/*
 * Copyright (c) 2017 - All Rights Reserved - Arash Hatami
 */

package helper;

public class Address {
	//public final static String[] provinces = new String[]{"", "آذربایجان شرقی", "آذربایجان غربی", "اردبیل", "اصفهان", "البرز", "ایلام", "بوشهر", "تهران", "چهارمحال و بختیاری", "خراسان جنوبی", "خراسان رضوی", "خراسان شمالی", "خوزستان", "زنجان", "سمنان", "سیستان و بلوچستان", "فارس", "قزوین", "قم", "کردستان", "کرمان", "کرمانشاه", "کهگیلویه و بویراحمد", "گلستان", "گیلان", "لرستان", "مازندران", "مرکزی", "هرمزگان", "همدان", "یزد"};
	public final static String[] provinces = new String[]{"همدان"};
	
	public final static String[] province0 = new String[]{""};
	public final static String[] province1 = new String[]{"آذرشهر", "اسکو", "اهر", "بستان‌آباد", "بناب", "تبریز", "جلفا", "چاراویماق", "سراب", "شبستر", "عجب‌شیر", "کلیبر", "مراغه", "مرند", "ملکان", "میانه", "ورزقان", "هریس", "هشترود"};
	public final static String[] province2 = new String[]{"ارومیه", "اشنویه", "بوکان", "پیرانشهر", "تکاب", "چالدران", "خوی", "سردشت", "سلماس", "شاهین‌دژ", "ماکو", "مهاباد", "میاندوآب", "نقده"};
	public final static String[] province3 = new String[]{"اردبیل", "بیله‌سوار", "پارس‌آباد", "خلخال", "کوثر", "گرمی", "مشگین شهر", "نمین", "نیر"};
	public final static String[] province4 = new String[]{"آران و بیدگل", "اردستان", "اصفهان", "برخوردار و میمه", "تیران و کرون", "چادگان", "خمینی‌شهر", "خوانسار", "سمیرم", "شهرضا", "سمیرم سفلی", "فریدن", "فریدون‌شهر", "فلاورجان", "کاشان", "گلپایگان", "لنجان", "مبارکه", "نائین", "نجف‌آباد", "نطنز"};
	public final static String[] province5 = new String[]{"ساوجبلاغ", "طالقان", "کرج", "نظرآباد"};
	public final static String[] province6 = new String[]{"آبدانان", "ایلام", "ایوان", "دره‌شهر", "دهلران", "شیروان و چرداول", "مهران"};
	public final static String[] province7 = new String[]{"بوشهر", "تنگستان", "جم", "دشتستان", "دشتی", "دیر", "دیلم", "کنگان", "گناوه"};
	public final static String[] province8 = new String[]{"ورامین", "فیروزکوه", "شهریار", "شمیرانات", "ری", "رباط‌کریم", "دماوند", "تهران", "پاکدشت", "اسلام‌شهر"};
	public final static String[] province9 = new String[]{"اردل", "بروجن", "شهرکرد", "فارسان", "کوهرنگ", "لردگان"};
	public final static String[] province10 = new String[]{"بیرجند", "درمیان", "سرایان", "سربیشه", "فردوس", "قائنات", "نهبندان"};
	public final static String[] province11 = new String[]{"بردسکن", "تایباد", "تربت جام", "تربت حیدریه", "چناران", "خلیل‌آباد", "خواف", "درگز", "رشتخوار", "سبزوار", "سرخس", "فریمان", "قوچان", "کاشمر", "کلات", "گناباد", "مشهد", "مه ولات", "نیشابور"};
	public final static String[] province12 = new String[]{"اسفراین", "بجنورد", "جاجرم", "شیروان", "فاروج", "مانه و سملقان"};
	public final static String[] province13 = new String[]{"آبادان", "امیدیه", "اندیمشک", "اهواز", "ایذه", "باغ‌ملک", "بندر ماهشهر", "بهبهان", "خرمشهر", "دزفول", "دشت آزادگان", "رامشیر", "رامهرمز", "شادگان", "شوش", "شوشتر", "گتوند", "لالی", "مسجد سلیمان", "هندیجان"};
	public final static String[] province14 = new String[]{"ابهر", "ایجرود", "خدابنده", "خرمدره", "زنجان", "طارم", "ماه‌نشان"};
	public final static String[] province15 = new String[]{"دامغان", "سمنان", "شاهرود", "گرمسار", "مهدی‌شهر"};
	public final static String[] province16 = new String[]{"ایرانشهر", "چابهار", "خاش", "دلگان", "زابل", "زاهدان", "زهک", "سراوان", "سرباز", "کنارک", "نیک‌شهر"};
	public final static String[] province17 = new String[]{"آباده", "ارسنجان", "استهبان", "اقلید", "بوانات", "پاسارگاد", "جهرم", "خرم‌بید", "خنج", "داراب", "زرین‌دشت", "سپیدان", "شیراز", "فراشبند", "فسا", "فیروزآباد", "قیر و کارزین", "کازرون", "لارستان", "لامرد", "مرودشت", "ممسنی", "مهر", "نی‌ریز"};
	public final static String[] province18 = new String[]{"آبیک", "البرز", "بوئین‌زهرا", "تاکستان", "قزوین"};
	public final static String[] province19 = new String[]{"قم"};
	public final static String[] province20 = new String[]{"بانه", "بیجار", "دیواندره", "سروآباد", "سقز", "سنندج", "قروه", "کامیاران", "مریوان"};
	public final static String[] province21 = new String[]{"بافت", "بردسیر", "بم", "جیرفت", "راور", "رفسنجان", "رودبار جنوب", "زرند", "سیرجان", "شهر بابک", "عنبرآباد", "قلعه گنج", "کرمان", "کوهبنان", "کهنوج", "منوجان"};
	public final static String[] province22 = new String[]{"اسلام‌آباد غرب", "پاوه", "ثلاث باباجانی", "جوانرود", "دالاهو", "روانسر", "سرپل ذهاب", "سنقر", "صحنه", "قصر شیرین", "کرمانشاه", "کنگاور", "گیلان غرب", "هرسین"};
	public final static String[] province23 = new String[]{"بویراحمد", "بهمئی", "دنا", "کهگیلویه", "گچساران"};
	public final static String[] province24 = new String[]{"آزادشهر", "آق‌قلا", "بندر گز", "ترکمن", "رامیان", "علی‌آباد", "کردکوی", "کلاله", "گرگان", "گنبد کاووس", "مراوه‌تپه", "مینودشت"};
	public final static String[] province25 = new String[]{"آستارا", "آستانه", "اشرفیه", "املش", "بندر انزلی", "رشت", "رضوانشهر", "رودبار", "رودسر", "سیاهکل", "شفت", "صومعه‌سرا", "طوالش", "فومن", "لاهیجان", "لنگرود", "ماسال"};
	public final static String[] province26 = new String[]{"ازنا", "الیگودرز", "بروجرد", "پل‌دختر", "خرم‌آباد", "دورود", "دلفان", "سلسله", "کوهدشت"};
	public final static String[] province27 = new String[]{"آمل", "بابل", "بابلسر", "بهشهر", "تنکابن", "جویبار", "چالوس", "رامسر", "ساری", "سوادکوه", "قائم‌شهر", "گلوگاه", "محمودآباد", "نکا", "نور", "نوشهر"};
	public final static String[] province28 = new String[]{"آشتیان", "اراک", "تفرش", "خمین", "دلیجان", "زرندیه", "ساوه", "شازند", "کمیجان", "محلات"};
	public final static String[] province29 = new String[]{"ابوموسی", "بستک", "بندر عباس", "بندر لنگه", "جاسک", "حاجی‌آباد", "خمیر", "رودان", "قشم", "گاوبندی", "میناب"};
	//public final static String[] province30 = new String[]{"اسدآباد", "بهار", "تویسرکان", "رزن", "کبودرآهنگ", "ملایر", "نهاوند", "همدان"};
	public final static String[] province30 = new String[]{"انتخاب کنید", "مریانج", "همدان"};
	public final static String[] province31 = new String[]{"ابرکوه", "اردکان", "بافق", "تفت", "خاتم", "صدوق", "طبس", "مهریز", "میبد", "یزد"};
}